ORTEChoiceRes/testsuites/RAD_Request/Agoda_MongoDB_Exist_roomcount=1/expectedResults/request_from_choiceres_to_crs.txt

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><OTA_HotelResNotifRQ xmlns="http://www.opentravel.org/OTA/2003/05" Version="5.000" EchoToken="8bb5cb72-620a-4315-a44b-1410ca4f3fbd" TimeStamp="2026-09-19T14:51:29.965+08:00" ResStatus="Commit"><POS><Source><RequestorID Type="5" ID="AGODA"/><BookingChannel Type="2"><CompanyName Code="DS"/></BookingChannel></Source></POS><HotelReservations><HotelReservation><UniqueID Type="22" ID="107464822"/><RoomStays><RoomStay><RoomRates><RoomRate RoomTypeCode="NK" RatePlanCode="SAGOD" NumberOfUnits="1"><Rates><Rate EffectiveDate="2026-09-12" ExpireDate="2026-09-13"><Base AmountBeforeTax="96.90" CurrencyCode="USD"/></Rate></Rates></RoomRate></RoomRates><GuestCounts><GuestCount AgeQualifyingCode="10" Count="2"/></GuestCounts><TimeSpan Start="2026-09-12" End="2026-09-13"/><Guarantee GuaranteeType="GuaranteeRequired" GuaranteeCode="CC"><GuaranteesAccepted><GuaranteeAccepted><PaymentCard CardNumber="5533************" ExpireDate="02/27" CardCode="MC"><CardHolderName>Agoda Company Pte Ltd.</CardHolderName></PaymentCard></GuaranteeAccepted></GuaranteesAccepted></Guarantee><BasicPropertyInfo HotelCode="CAD05"/><Comments><Comment GuestViewable="1"><Text>Chg virtual cc room + tax. For support call +1 702 979 7189</Text></Comment></Comments><SpecialRequest><Text>Breakfast included;</Text></SpecialRequest></RoomStay></RoomStays><ResGuests><ResGuest><Profiles><ProfileInfo><UniqueID Type="5" ID="96637800"/><Profile ProfileType="1"><Customer><PersonName><GivenName>JOHN</GivenName><Surname>SEARS</Surname></PersonName><Telephone FormattedInd="true" PhoneNumber="65-62484615" PhoneLocationType="6"/><Email EmailType="1">biz@agoda.com</Email><Address Type="1"><AddressLine>999/9 RAMA I RORD THE OFFICE,AT CENTRAL WORLD TOW 27TH FLR=.code=US=BANGKOK==United States of America</AddressLine></Address></Customer></Profile></ProfileInfo></Profiles></ResGuest></ResGuests></HotelReservation></HotelReservations></OTA_HotelResNotifRQ></soap:Body></soap:Envelope>
